### Terraform Plan Output (stg)
```
[0m[1mgoogle_storage_bucket.demo: Refreshing state... [id=ariyansappdev1-ariyans-learning-hub][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # google_storage_bucket.demo[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "google_storage_bucket" "demo" {
      [31m-[0m[0m default_event_based_hold    = false [90m-> null[0m[0m
      [31m-[0m[0m enable_object_retention     = false [90m-> null[0m[0m
      [33m~[0m[0m id                          = "ariyansappdev1-ariyans-learning-hub" -> (known after apply)
      [31m-[0m[0m labels                      = {} [90m-> null[0m[0m
      [33m~[0m[0m name                        = "ariyansappdev1-ariyans-learning-hub" [33m->[0m[0m "ariyansappdev11-ariyans-learning-hub" [31m# forces replacement[0m[0m
      [33m~[0m[0m project                     = "ariyans-learning-hub" -> (known after apply)
      [33m~[0m[0m project_number              = 300461951628 -> (known after apply)
      [33m~[0m[0m public_access_prevention    = "inherited" -> (known after apply)
      [31m-[0m[0m requester_pays              = false [90m-> null[0m[0m
      [32m+[0m[0m rpo                         = (known after apply)
      [33m~[0m[0m self_link                   = "https://www.googleapis.com/storage/v1/b/ariyansappdev1-ariyans-learning-hub" -> (known after apply)
      [33m~[0m[0m time_created                = "2025-11-08T05:20:01.355Z" -> (known after apply)
      [33m~[0m[0m updated                     = "2025-11-08T05:20:01.355Z" -> (known after apply)
      [33m~[0m[0m url                         = "gs://ariyansappdev1-ariyans-learning-hub" -> (known after apply)
        [90m# (6 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m hierarchical_namespace {
          [31m-[0m[0m enabled = false [90m-> null[0m[0m
        }

      [33m~[0m[0m soft_delete_policy (known after apply)
      [31m-[0m[0m soft_delete_policy {
          [31m-[0m[0m effective_time             = "2025-11-08T05:20:01.355Z" [90m-> null[0m[0m
          [31m-[0m[0m retention_duration_seconds = 604800 [90m-> null[0m[0m
        }

      [33m~[0m[0m versioning (known after apply)

      [33m~[0m[0m website (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Commentterraform-plan -->